<a href="https://colab.research.google.com/github/nisenogueira/Imersao-Python-Dados-ALURA/blob/main/ALURA_AULA_01.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Aula 01 - Explore Dados com Pandas

In [3]:
# importando a biblioteca Pandas para o projeto

import pandas as pd

In [4]:
# O primeiro passo é importar a base de dados que vamos utilizar no projeto. O link utilizado está disponivel no repositorio da Alura.

df = pd.read_csv("https://raw.githubusercontent.com/guilhermeonrails/data-jobs/refs/heads/main/salaries.csv")

In [5]:
# Iniciamos visualizado as primeiras linhas da base de dados.

df.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [6]:
# O método .info() fornece um resumo conciso do DataFrame, incluindo o número de entradas, o número de colunas, os tipos de dados de cada coluna e a quantidade
# de valores não nulos.

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 133349 entries, 0 to 133348
Data columns (total 11 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   work_year           133339 non-null  float64
 1   experience_level    133349 non-null  object
 2   employment_type     133349 non-null  object
 3   job_title           133349 non-null  object
 4   salary              133349 non-null  int64
 5   salary_currency     133349 non-null  object
 6   salary_in_usd       133349 non-null  int64
 7   employee_residence  133349 non-null  object
 8   remote_ratio        133349 non-null  int64
 9   company_location    133349 non-null  object
 10  company_size        133349 non-null  object
dtypes: float64(1), int64(3), object(7)
memory usage: 11.2+ MB

In [7]:
# O método .describe() é utilizado para gerar estatísticas descritivas de uma base de dados. Ele fornece um resumo estatístico das colunas numéricas, incluindo contagem,
# média, desvio padrão, valores mínimo e máximo, e os percentis.

df.describe()

           work_year        salary  salary_in_usd   remote_ratio
count  133339.000000  1.333490e+05  133349.000000  133349.000000
mean     2024.358770  1.632833e+05  157617.272098      20.905669
std         0.680627  2.173860e+05   74288.363097      40.590044
min      2020.000000  1.400000e+04   15000.000000       0.000000
25%      2024.000000  1.060200e+05  106000.000000       0.000000
50%      2024.000000  1.470000e+05  146206.000000       0.000000
75%      2025.000000  1.990000e+05  198000.000000       0.000000
max      2025.000000  3.040000e+07  800000.000000     100.000000

In [8]:
# Já o atributo .shape em Python é utilizado para obter as dimensões de uma base de dados. Ele retorna uma tupla que contém o número de linhas e o número de colunas.

df.shape

(133349, 11)

In [9]:
# Criando a variavel 'linha' e 'coluna' pegando o primeiro e o segundo item de 'shape'.

linhas, colunas = df.shape[0], df.shape[1]
print("linhas:", linhas)
print("colunas:", colunas)

linhas: 133349
colunas: 11

In [14]:
# Visualizando o nome de todas as colunas presentes na base de dados.

df.columns

Index(['work_year', 'experience_level', 'employment_type', 'job_title',
       'salary', 'salary_currency', 'salary_in_usd', 'employee_residence',
       'remote_ratio', 'company_location', 'company_size'],
      dtype='object')

In [18]:
# Agora vamos comecar a melhorar a visualização dos dados, renomeando as colunas para nomes mais descritivos em Português.

df.rename(columns={
    'work_year': 'ano',
    'experience_level': 'senioridade',
    'employment_type': 'contrato',
    'job_title': 'cargo',
    'salary': 'salario',
    'salary_in_usd': 'moeda',
    'salario_em_usd': 'usd',
    'employee_residence': 'residencia',
    'remote_ratio': 'remoto',
    'company_location': 'empresa',
    'company_size': 'tamanho_empresa'
}, inplace=True)
df.columns

Index(['ano', 'senioridade', 'contrato', 'cargo', 'salario', 'salary_currency',
       'moeda', 'residencia', 'remoto', 'empresa', 'tamanho_empresa'],
      dtype='object')

In [19]:
# Vamos verificar se as alterações foram feitas corretamente.

df.head()

,ano,senioridade,contrato,cargo,salario,salary_currency,moeda,residencia,remoto,empresa,tamanho_empresa
0,2025.0,SE,FT,Solutions Engineer,214000,USD,214000,US,100,US,M
1,2025.0,SE,FT,Solutions Engineer,136000,USD,136000,US,100,US,M
2,2025.0,MI,FT,Data Engineer,158800,USD,158800,AU,0,AU,M
3,2025.0,MI,FT,Data Engineer,139200,USD,139200,AU,0,AU,M
4,2025.0,EN,FT,Data Engineer,90000,USD,90000,US,0,US,M

In [21]:
# Começamos agora a fazer algumas analises.
# O método df["senioridade"].value_counts() é utilizado para contar a frequência de cada valor único na coluna "senioridade" da base de dados.
# Isso é útil para entender a distribuição dos níveis de experiência dos funcionários.
# Vale lembrar que esse metodo calcula apenas dados numéricos.

df["senioridade"].value_counts()

senioridade
SE    77241
MI    40465
EN    12443
EX     3200
Name: count, dtype: int64

In [22]:
# Faremos o mesmo com algumas outras colunas que são relevantes para essa analise.

df["contrato"].value_counts()

contrato
FT    132563
CT       394
PT       376
FL        16
Name: count, dtype: int64

In [23]:
# Aqui contaremos quantas pessoas trabalham em cada categoria da coluna 'remoto' [0 = trabalho presencial, 100 = remoto, 50 = hibrido]

df["remoto"].value_counts()

remoto
0      105312
100     27718
50        319
Name: count, dtype: int64

In [24]:
# O total de pessoas que trabalham em cada tipo de contrato de trabalho ['full time, contrato, part time, freelancer']

df["contrato"].value_counts()

contrato
FT    132563
CT       394
PT       376
FL        16
Name: count, dtype: int64

In [26]:
# A contagem do tamanho das empresas que estão na base de dados. [Medium, Large, Small]

df["tamanho_empresa"].value_counts()

tamanho_empresa
M    129561
L      3574
S       214
Name: count, dtype: int64

In [27]:
# O total de cada categoria de senioridade

df['senioridade'] = df['senioridade'].replace({
    'SE': 'Senior',
    'MI': 'Pleno',
    'EN': 'Junior',
    'EX': 'Executivo'
})
df['senioridade'].value_counts()

senioridade
Senior       77241
Pleno        40465
Junior       12443
Executivo     3200
Name: count, dtype: int64

In [30]:
# Podemos também traduzir os dados dentro das colunas para facilitar a leitura.

df['contrato'] = df['contrato'].replace({
    'FT': 'Tempo Integral',
    'CT': 'Contrato',
    'PT': 'Meio Período',
    'FL': 'Freelancer'
})
df['contrato'].value_counts()

contrato
Tempo Integral    132563
Contrato             394
Meio Período         376
Freelancer            16
Name: count, dtype: int64

In [32]:
df['tamanho_empresa'] = df['tamanho_empresa'].replace({
    'M': 'Médio',
    'L': 'Grande',
    'S': 'Pequeno'
})
df['tamanho_empresa'].value_counts()

tamanho_empresa
Médio      129561
Grande       3574
Pequeno       214
Name: count, dtype: int64

In [33]:
df['remoto'] = df['remoto'].replace({
    0: 'Presencial',
    100: 'Remoto',
    50: 'Híbrido'
})
df['remoto'].value_counts()

remoto
Presencial    105312
Remoto         27718
Híbrido          319
Name: count, dtype: int64

In [34]:
# Mais uma vez vamos verificar se as modificações foram feitas

df.head()

,ano,senioridade,contrato,cargo,salario,salary_currency,moeda,residencia,remoto,empresa,tamanho_empresa
0,2025.0,Senior,Tempo Integral,Solutions Engineer,214000,USD,214000,US,Remoto,US,Médio
1,2025.0,Senior,Tempo Integral,Solutions Engineer,136000,USD,136000,US,Remoto,US,Médio
2,2025.0,Pleno,Tempo Integral,Data Engineer,158800,USD,158800,AU,Presencial,AU,Médio
3,2025.0,Pleno,Tempo Integral,Data Engineer,139200,USD,139200,AU,Presencial,AU,Médio
4,2025.0,Junior,Tempo Integral,Data Engineer,90000,USD,90000,US,Presencial,US,Médio

In [35]:
# Como ultima analise desta primeira aula, vamos agora utilizar o metodo .describe(include='object')
# que é utilizado para gerar estatisticas descritivas de colunas não numéricas (geralmente strings)

df.describe(include='object')

,senioridade,contrato,cargo,salary_currency,residencia,remoto,empresa,tamanho_empresa
count,133349,133349,133349,133349,133349,133349,133349,133349
unique,4,4,390,26,102,3,95,3
top,Senior,Tempo Integral,Data Scientist,USD,US,Presencial,US,Médio
freq,77241,132563,17314,126140,119579,105312,119641,129561

In [36]:
df.describe()

                 ano       salario          moeda
count  133339.000000  1.333490e+05  133349.000000
mean     2024.358770  1.632833e+05  157617.272098
std         0.680627  2.173860e+05   74288.363097
min      2020.000000  1.400000e+04   15000.000000
25%      2024.000000  1.060200e+05  106000.000000
50%      2024.000000  1.470000e+05  146206.000000
75%      2025.000000  1.990000e+05  198000.000000
max      2025.000000  3.040000e+07  800000.000000